[Pandas lessons](https://bitbucket.org/hrojas/learn-pandas/src/master/)

In [1]:
import pandas as pd
import numpy as np

In [121]:
def write_in_file(file_name, *some):
    with open(file_name, 'w') as file:
        if type(some) == int or type(some) == float:
            some = list(map(lambda x: str(round(x, 2)), some))
        file.write(" ".join(some))

In [3]:
data = pd.read_csv('titanic.csv', index_col='PassengerId')

In [4]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.Pclass.head()

PassengerId
1    3
2    1
3    3
4    1
5    3
Name: Pclass, dtype: int64

___
#### 1. Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.

In [91]:
male = data.Sex.value_counts()[0]
male

577

In [89]:
female = data.Sex.value_counts()[1]
female

314

In [8]:
print(female + male, data.shape[0])

891 891

In [36]:
write_in_file("01_male_female.txt", male, female)

___
#### 2. Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

Survived: 0 - no, 1 - yes

In [16]:
data[:1]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [86]:
res = data.Survived.value_counts()[1] / data.shape[0]
all_people = data.shape[0]
res

0.3838383838383838

In [32]:
write_in_file("02_surv.txt", res * 100)

____
#### 3. Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

pclass - Ticket class: 1 = 1st, 2 = 2nd, 3 = 3rd

In [87]:
res = data.Pclass.value_counts()[1] / all_people
res

0.24242424242424243

In [35]:
write_in_file("03_1st_class_people.txt", res * 100)

___
#### 4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.

In [37]:
data.head(1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [66]:
age = data.Age.dropna()
age[:6]

PassengerId
1    22.0
2    38.0
3    26.0
4    35.0
5    35.0
7    54.0
Name: Age, dtype: float64

In [73]:
mean = age.mean()
median = age.median()
print(mean, median)

29.69911764705882 28.0

In [74]:
write_in_file("04_mean_median.txt", mean, median)

___
#### 5. Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [75]:
data[:1]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [79]:
res = data.SibSp.corr(data.Parch)
res

0.4148376986201567

In [80]:
write_in_file("05_Pirson_corr.txt", res)

___
#### 6. Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [123]:
# unexpected regular expression
import re
def clean_name(name):
    
    # Первое слово до запятой - фамилия
    s = re.search('^[^,]+, (.*)', name)
    if s:
        name = s.group(1)

    # Если есть скобки - то имя пассажира в них
    s = re.search('\(([^)]+)\)', name)
    if s:
        name = s.group(1)
    # Удаляем обращения
    name = re.sub('(Miss\. |Mrs\. |Ms\. )', '', name)
    # Берем первое оставшееся слово и удаляем кавычки
    name = name.split(' ')[0].replace('"', '')
    return name

In [96]:
names = data[data.Sex == "female"].Name
names[:4]

PassengerId
2    Cumings, Mrs. John Bradley (Florence Briggs Th...
3                               Heikkinen, Miss. Laina
4         Futrelle, Mrs. Jacques Heath (Lily May Peel)
9    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Name, dtype: object

In [103]:
names = names.map(clean_name)
names[:5]

PassengerId
2      Florence
3         Laina
4          Lily
9     Elisabeth
10        Adele
Name: Name, dtype: object

In [110]:
name_counts = names.value_counts()
name_counts[:4]

Mary         15
Anna         15
Elizabeth    11
Margaret     10
Name: Name, dtype: int64

In [118]:
res = name_counts.head(1).index.values[0]
res

'Mary'

In [122]:
write_in_file("06_most_common_name.txt", res)